# Даны два числа. Выведите знач-е наим-го числа из них
a = 5
b = 4
if a < b:
    print('Наименьший A:' ,a)
else:
    print('Наименьший B:' ,b)
