# Дана строка, состоящая из слов, разделенных пробелами.
# Определите сколько в ней слов.
string = 'Zarina Emir Baizak Sultan Nazira Aijan Maksim'
count_space = string.count(" ")
print(count_space + 1)


string = 'Zarina Emir Baizak Sultan Nazira Aijan Maksim'
string = string.split(" ")
print(len(string))






