# Найдите колл-во положительных элементов в данном списке.

number_list = [1,-1,2,-2,3,-3]
i = 0
while i < len(number_list):
    if number_list[i] > 0:
        print(number_list[i])
    i = i + 1
