# Вам дано полож-е кол-во числа
# Определите кол-во цифр
number = 1356666666
str_number = str(number)
print(len(str_number))